package com.example.cashincontrol.domain.parsing

import com.example.cashincontrol.domain.transaction.CheckCategory

val baseCheckCategories: List<CheckCategory> = listOf(
    CheckCategory(
        name = "Молочные продукты",
        hashSetOf(
            "молоко", "кефир", "йогурт", "сыр", "сливки", "ряженка", "творог",
            "простоквашино", "домик в деревне", "актимель", "сметана", "брынза",
            "маскарпоне", "моцарелла", "данон", "чудо", "ростагроэкспорт"
        )
    ),
    CheckCategory(
        name = "Хлебобулочные изделия",
        hashSetOf(
            "хлеб", "булка", "батон", "лепешка", "сайка", "лаваш", "круассан",
            "слойка", "выпечка", "багет", "бородинский", "дарницкий", "чиабатта",
            "булочка", "пирог", "пирожок", "сдоба", "кекс", "бублик"
        )
    ),
    CheckCategory(
        name = "Овощи",
        hashSetOf(
            "помидор", "огурец", "картофель", "морковь", "лук", "капуста",
            "свекла", "чеснок", "баклажан", "перец", "кабачок", "редис",
            "редька", "брюква", "патиссон", "тыква", "салат", "шпинат",
            "укроп", "петрушка", "кинза", "базилик", "руккола", "щавель"
        )
    ),
    CheckCategory(
        name = "Мясные продукты",
        hashSetOf(
            "курица", "свинина", "говядина", "котлеты", "сосиски", "колбаса",
            "фарш", "ветчина", "бекон", "буженина", "паштет", "шпик", "сало",
            "окорок", "карбонад", "пельмени", "чебупели", "наггетсы", "стейк",
            "антрекот", "шашлык", "шницель", "рулет", "сардельки", "мясной деликатес", "колб"
        )
    ),
    CheckCategory(
        name = "Бакалея",
        hashSetOf(
            "гречка", "макароны", "горох", "рис", "сахар", "мука", "овсянка",
            "манка", "крупа", "спагетти", "перловка", "пшено", "кукурузная крупа",
            "ячневая крупа", "булгур", "кус-кус", "полба", "соль", "крахмал"
        )
    ),
    CheckCategory(
        name = "Фрукты",
        hashSetOf(
            "яблоко", "банан", "апельсин", "груша", "манго", "киви", "лимон",
            "виноград", "мандарин", "ананас", "грейпфрут", "персик", "нектарин",
            "слива", "абрикос", "хурма", "инжир", "гранат", "папайя", "авокадо"
        )
    ),
    CheckCategory(
        name = "Напитки",
        hashSetOf(
            "вода", "сок", "кола", "фанта", "напиток", "чай", "кофе", "пиво",
            "квас", "лимонад", "минералка", "морс", "компот", "нектар",
            "энергетик", "ситро", "сбитень", "айран", "тан", "кефирный напиток"
        )
    ),
    CheckCategory(
        name = "Рыбные продукты",
        hashSetOf(
            "рыба", "лосось", "сельдь", "икра", "треска", "форель", "скумбрия",
            "краб", "шпроты", "тунец", "минтай", "хек", "судак", "окунь",
            "камбала", "палтус", "семга", "кижуч", "горбуша", "кета", "мойва",
            "анчоус", "сардина", "карась", "карп", "щука", "налим", "омуль",
            "муксун", "чир", "нельма", "стерлядь", "осетр", "белуга", "сиг",
            "рыбные палочки", "крабовые палочки", "морской коктейль", "морепродукты"
        )
    ),
    CheckCategory(
        name = "Сладости",
        hashSetOf(
            "шоколад", "печенье", "конфеты", "вафли", "зефир", "пирожное",
            "торт", "мармелад", "мороженое", "пастила", "пряник", "козинак",
            "халва", "ирис", "леденец", "суфле", "шоколадка", "батончик",
            "драже", "шоколадные конфеты", "карамель", "трюфель", "шоколадный батончик"
        )
    )
)