package com.example.cashincontrol.domain.parsing

import com.example.cashincontrol.domain.transaction.CheckCategory

val baseCheckCategories: List<CheckCategory> = listOf(
    CheckCategory(
        "Молочные продукты",
        hashSetOf("молоко", "кефир", "йогурт", "сыр", "сливки", "ряженка", "творог",
            "простоквашино", "домик в деревне", "актимель", "сметана", "брынза",
            "маскарпоне", "моцарелла", "данон", "чудо", "ростагроэкспорт", "мол")
    ),
    CheckCategory(
        "Хлебобулочные изделия",
        hashSetOf("хлеб", "булка", "батон", "лепешка", "сайка", "лаваш", "круассан",
            "слойка", "выпечка", "багет", "бородинский", "дарницкий", "чиабатта",
            "булочка", "пирог", "пирожок", "сдоба", "кекс", "бублик")
    ),
    CheckCategory(
        "Овощи",
        hashSetOf("помидор", "огурец", "картофель", "морковь", "лук", "капуста",
            "свекла", "чеснок", "баклажан", "перец", "кабачок", "редис",
            "редька", "брюква", "патиссон", "тыква", "салат", "шпинат",
            "укроп", "петрушка", "кинза", "базилик", "руккола", "щавель")
    ),
    CheckCategory(
        "Мясные продукты",
        hashSetOf("курица", "свинина", "говядина", "котлеты", "сосиски", "колбаса",
            "фарш", "ветчина", "бекон", "буженина", "паштет", "шпик", "сало",
            "окорок", "карбонад", "пельмени", "чебупели", "наггетсы", "стейк",
            "антрекот", "шашлык", "шницель", "рулет", "сардельки", "мясной деликатес", "колб")
    ),
)